#include<stdio.h>
int main() {
printf("10진수= %d \n", 65);
// 0100 0001
printf("10진수= %5d \n", 65); // 5: 자릿수
printf("16진수= %x \n", 65);
printf("16진수= %#x \n", 65);
printf("16진수= %#X \n", 65);
// 0100 0001
// 4 1
printf("8진수= %o \n", 65);
printf("8진수= %#o \n", 65);
// 001 000 001
// 1 0 1
printf("문자= %c \n", 65);
// 0100 0001
// 4 1
printf("10진수 = %d, 16진수 = %#X, 8진수 = %#o, 문자 = %c \n", 65, 65, 65, 65);
printf("10진수 = %d, 16진수 = %#X, 8진수 = %#o, 문자 = %c \n", 97, 97, 97, 97);
printf("10진수 = %d, 16진수 = %#X, 8진수 = %#o, 문자 = %c \n", 49, 49, 49, 49);
printf("-----------------------------------\n");
printf("10진수 = %d, 16진수 = %#X \n", 250, 250);
printf("10진수 = %d, 16진수 = %#x \n", 250, 250);
return 0;
}
